Ran Apply for project: `clb` dir: `clb` workspace: `default`

<details><summary>Show Output</summary>

```diff
Fetching temporary credentials...
Setting environment variables...
TENCENTCLOUD_SECRET_ID=AKIDwxPWpE1p10fIwmBrpr7S4IyK2Hq24NE5L9hoRv_YNcyKgF8IVwnbkQSojUc5js1Q
TENCENTCLOUD_SECRET_KEY=itOWsfKQqlob/8xthK4kMl0uk6cSmpJrnwX1L3qO46M=
TENCENTCLOUD_SECURITY_TOKEN=bKDpgeyK3k25XJNkPUs0cwYWryQ92M5a7ab66c72d079a1fcc49d30bd546ae1advfhM-AyXOopZtA5a7bH_XAyC8z4wKlrMxXK4PZv0MPMBwgD1Cj1YvtvBynZNs0JBCqtn-OiSr7znIPc9MK5IYurLFHOq_eDNdrxc85b7BrREzQNI2H6EHKYa-FkLhnxWWOssGegWD5DVNTQj5nQDMYIyHzazzvcgP3WPsddsq51kUXjpOfAecnikfSQ4mYLjLmh0Etyq5NsnUOzlM_mI2b6llIbJppJCAyZiYThhxTVuGtOaFO0FBmENx4IsuxQOAoAPTiAUQSY4T_JkBQZEGrnhmjU3D0Z6v4RquQH6vW-T83ZrfrWMj19vCiahi2bG

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # tencentcloud_clb_attachment.attachment_tcp will be created
  + resource "tencentcloud_clb_attachment" "attachment_tcp" {
      + clb_id        = (known after apply)
      + id            = (known after apply)
      + listener_id   = (known after apply)
      + protocol_type = (known after apply)

      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
      + targets {
          + instance_id = (known after apply)
          + port        = 8080
          + weight      = 10
            # (1 unchanged attribute hidden)
        }
    }

  # tencentcloud_clb_instance.cicd_foo will be created
  + resource "tencentcloud_clb_instance" "cicd_foo" {
      + address_ip_version           = (known after apply)
      + address_ipv6                 = (known after apply)
      + clb_name                     = "cicd_foo_clb"
      + clb_vips                     = (known after apply)
      + domain                       = (known after apply)
      + id                           = (known after apply)
      + internet_bandwidth_max_out   = (known after apply)
      + internet_charge_type         = (known after apply)
      + ipv6_mode                    = (known after apply)
      + load_balancer_pass_to_target = false
      + network_type                 = "OPEN"
      + project_id                   = 0
      + security_groups              = (known after apply)
      + sla_type                     = (known after apply)
      + target_region_info_region    = (known after apply)
      + target_region_info_vpc_id    = (known after apply)
      + vip                          = (known after apply)
      + vip_isp                      = (known after apply)
      + vpc_id                       = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_dst will be created
  + resource "tencentcloud_clb_listener" "listener_http_dst" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_dst"
      + port                       = 81
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_http_src will be created
  + resource "tencentcloud_clb_listener" "listener_http_src" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_http_src"
      + port                       = 80
      + protocol                   = "HTTP"
      + scheduler                  = "WRR"
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener.listener_tcp will be created
  + resource "tencentcloud_clb_listener" "listener_tcp" {
      + clb_id                     = (known after apply)
      + end_port                   = (known after apply)
      + health_check_context_type  = (known after apply)
      + health_check_health_num    = 2
      + health_check_http_code     = 2
      + health_check_http_method   = "GET"
      + health_check_http_version  = "HTTP/1.0"
      + health_check_interval_time = 100
      + health_check_port          = 200
      + health_check_switch        = true
      + health_check_time_out      = 30
      + health_check_type          = "HTTP"
      + health_check_unhealth_num  = 2
      + health_source_ip_type      = (known after apply)
      + id                         = (known after apply)
      + keepalive_enable           = (known after apply)
      + listener_id                = (known after apply)
      + listener_name              = "listener_tcp"
      + port                       = 8080
      + protocol                   = "TCP"
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + session_type               = (known after apply)
      + target_type                = (known after apply)
    }

  # tencentcloud_clb_listener_rule.rule_http_dst will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_dst" {
      + clb_id                     = (known after apply)
      + domain                     = "abcd.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_listener_rule.rule_http_src will be created
  + resource "tencentcloud_clb_listener_rule" "rule_http_src" {
      + clb_id                     = (known after apply)
      + domain                     = "abc.com"
      + forward_type               = (known after apply)
      + health_check_health_num    = (known after apply)
      + health_check_http_code     = (known after apply)
      + health_check_http_domain   = (known after apply)
      + health_check_http_method   = (known after apply)
      + health_check_http_path     = (known after apply)
      + health_check_interval_time = (known after apply)
      + health_check_switch        = (known after apply)
      + health_check_time_out      = (known after apply)
      + health_check_type          = (known after apply)
      + health_check_unhealth_num  = (known after apply)
      + http2_switch               = (known after apply)
      + id                         = (known after apply)
      + listener_id                = (known after apply)
      + quic                       = (known after apply)
      + rule_id                    = (known after apply)
      + scheduler                  = "WRR"
      + session_expire_time        = 30
      + target_type                = "NODE"
      + url                        = "/"
    }

  # tencentcloud_clb_redirection.redirection_http will be created
  + resource "tencentcloud_clb_redirection" "redirection_http" {
      + clb_id                  = (known after apply)
      + delete_all_auto_rewrite = false
      + id                      = (known after apply)
      + source_listener_id      = (known after apply)
      + source_rule_id          = (known after apply)
      + target_listener_id      = (known after apply)
      + target_rule_id          = (known after apply)
    }

  # tencentcloud_instance.cicd_foo_1 will be created
  + resource "tencentcloud_instance" "cicd_foo_1" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm1"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)
    }

  # tencentcloud_instance.cicd_foo_2 will be created
  + resource "tencentcloud_instance" "cicd_foo_2" {
      + allocate_public_ip                      = false
      + availability_zone                       = "ap-jakarta-2"
      + cpu                                     = (known after apply)
      + create_time                             = (known after apply)
      + disable_api_termination                 = false
      + disable_monitor_service                 = false
      + disable_security_service                = false
      + expired_time                            = (known after apply)
      + force_delete                            = false
      + id                                      = (known after apply)
      + image_id                                = "img-9qrfy1xt"
      + instance_charge_type                    = "POSTPAID_BY_HOUR"
      + instance_charge_type_prepaid_renew_flag = (known after apply)
      + instance_name                           = "cicd_foo_cvm2"
      + instance_status                         = (known after apply)
      + instance_type                           = "S5.MEDIUM2"
      + internet_charge_type                    = (known after apply)
      + internet_max_bandwidth_out              = 0
      + key_ids                                 = (known after apply)
      + key_name                                = (known after apply)
      + memory                                  = (known after apply)
      + orderly_security_groups                 = (known after apply)
      + os_name                                 = (known after apply)
      + private_ip                              = (known after apply)
      + project_id                              = 0
      + public_ip                               = (known after apply)
      + running_flag                            = true
      + security_groups                         = (known after apply)
      + subnet_id                               = (known after apply)
      + system_disk_id                          = (known after apply)
      + system_disk_size                        = 50
      + system_disk_type                        = "CLOUD_PREMIUM"
      + uuid                                    = (known after apply)
      + vpc_id                                  = (known after apply)
    }

  # tencentcloud_security_group.cicd_foo will be created
  + resource "tencentcloud_security_group" "cicd_foo" {
      + id         = (known after apply)
      + name       = "cicd-foo-sg"
      + project_id = (known after apply)
    }

  # tencentcloud_subnet.cicd_foo will be created
  + resource "tencentcloud_subnet" "cicd_foo" {
      + availability_zone  = "ap-jakarta-2"
      + available_ip_count = (known after apply)
      + cidr_block         = "10.0.0.0/16"
      + create_time        = (known after apply)
      + id                 = (known after apply)
      + is_default         = (known after apply)
      + is_multicast       = false
      + name               = "cicd-foo-subnet"
      + route_table_id     = (known after apply)
      + vpc_id             = (known after apply)
    }

  # tencentcloud_vpc.cicd_foo will be created
  + resource "tencentcloud_vpc" "cicd_foo" {
      + assistant_cidrs        = (known after apply)
      + cidr_block             = "10.0.0.0/16"
      + create_time            = (known after apply)
      + default_route_table_id = (known after apply)
      + dns_servers            = (known after apply)
      + docker_assistant_cidrs = (known after apply)
      + id                     = (known after apply)
      + is_default             = (known after apply)
      + is_multicast           = false
      + name                   = "cicd-foo-vpc"
    }

Plan: 13 to add, 0 to change, 0 to destroy.

Changes to Outputs:
  + clb_instance_id  = (known after apply)
  + cvm1_instance_id = (known after apply)
  + cvm2_instance_id = (known after apply)
tencentcloud_security_group.cicd_foo: Creating...
tencentcloud_vpc.cicd_foo: Creating...
tencentcloud_security_group.cicd_foo: Creation complete after 1s [id=sg-fwtte6zl]
tencentcloud_vpc.cicd_foo: Creation complete after 3s [id=vpc-chscozsg]
tencentcloud_subnet.cicd_foo: Creating...
tencentcloud_clb_instance.cicd_foo: Creating...
tencentcloud_subnet.cicd_foo: Creation complete after 1s [id=subnet-6itbwu9x]
tencentcloud_instance.cicd_foo_1: Creating...
tencentcloud_instance.cicd_foo_2: Creating...
tencentcloud_clb_instance.cicd_foo: Still creating... [10s elapsed]
tencentcloud_instance.cicd_foo_2: Still creating... [10s elapsed]
tencentcloud_instance.cicd_foo_1: Still creating... [10s elapsed]
tencentcloud_clb_instance.cicd_foo: Creation complete after 15s [id=lb-7otd26iz]
tencentcloud_clb_listener.listener_http_src: Creating...
tencentcloud_clb_listener.listener_tcp: Creating...
tencentcloud_clb_listener.listener_http_dst: Creating...
tencentcloud_clb_listener.listener_http_src: Creation complete after 1s [id=lb-7otd26iz#lbl-8c98o6w1]
tencentcloud_clb_listener_rule.rule_http_src: Creating...
tencentcloud_clb_listener.listener_tcp: Creation complete after 2s [id=lb-7otd26iz#lbl-psy8gh0j]
tencentcloud_clb_listener.listener_http_dst: Creation complete after 2s [id=lb-7otd26iz#lbl-9gw8lwyx]
tencentcloud_clb_listener_rule.rule_http_dst: Creating...
tencentcloud_instance.cicd_foo_2: Still creating... [20s elapsed]
tencentcloud_instance.cicd_foo_1: Still creating... [20s elapsed]
tencentcloud_clb_listener_rule.rule_http_src: Still creating... [10s elapsed]
tencentcloud_clb_listener_rule.rule_http_dst: Still creating... [10s elapsed]
tencentcloud_instance.cicd_foo_2: Still creating... [30s elapsed]
tencentcloud_instance.cicd_foo_1: Still creating... [30s elapsed]
tencentcloud_instance.cicd_foo_1: Creation complete after 32s [id=ins-e2gg3jjd]
tencentcloud_instance.cicd_foo_2: Creation complete after 32s [id=ins-ft2dzfu3]
tencentcloud_clb_attachment.attachment_tcp: Creating...
tencentcloud_clb_listener_rule.rule_http_src: Creation complete after 18s [id=lb-7otd26iz#lbl-8c98o6w1#loc-h0i27wu9]
tencentcloud_clb_listener_rule.rule_http_dst: Still creating... [20s elapsed]
tencentcloud_clb_listener_rule.rule_http_dst: Creation complete after 26s [id=lb-7otd26iz#lbl-9gw8lwyx#loc-ekv6e8ip]
tencentcloud_clb_redirection.redirection_http: Creating...
tencentcloud_clb_attachment.attachment_tcp: Still creating... [10s elapsed]
tencentcloud_clb_attachment.attachment_tcp: Creation complete after 12s [id=#lbl-psy8gh0j#lb-7otd26iz]
tencentcloud_clb_redirection.redirection_http: Creation complete after 4s [id=loc-h0i27wu9#loc-ekv6e8ip#lbl-8c98o6w1#lbl-9gw8lwyx#lb-7otd26iz]

Apply complete! Resources: 13 added, 0 changed, 0 destroyed.

Outputs:

clb_instance_id = "lb-7otd26iz"
cvm1_instance_id = "ins-e2gg3jjd"
cvm2_instance_id = "ins-ft2dzfu3"
```

</details>